" Включаем несовместимость настроек с предшественником Vi
set nocompatible
" Включаем перенос строк (set nowrap отключает перенос строк)
set wrap
" Перенос строк по словам, а не по буквам
set linebreak
" Выключаем поддержку мыши при работе в терминале (для включения нужно устaновить mouse=a)
set mouse=
" Включаем подсветку синтаксиса
syntax on
" Включаем отображение выполняемой в данный момент команды в правом нижнем углу экрана
set showcmd
" Показывать строку с позицией курсора
set ruler
" Показывать первую парную скобку после ввода второй
set showmatch
" Показывать строку вкладок всегда
set showtabline=2
" Показывать строку статуса всегда
set laststatus=2
" Показывать имя буфера в заголовке терминала
set title
" Формат заголовка
set titlestring=%t%(\ %m%)%(\ %r%)%(\ %h%)%(\ %w%)%(\ (%{expand(\»%:p:~:h\»)})%)\ -\ VIM
" Использовать диалоги вместо сообщений об ошибках
set confirm
" Включаем отображение дополнительной информации в статусной строке
set statusline=%<%f%h%m%r%=format=%{&fileformat}\ file=%{&fileencoding}\ enc=%{&encoding}\ %b\ 0x%B\ %l,%c%V\ %P
" Включаем виртуальный звонок (мигание вместо спикера)
set visualbell
" Не выгружать буфер, когда переключаемся на другой файл
set hidden
" Использовать больше цветов в терминале
set t_Co=256
" Задаем фон терминала, что влияет на подсветку
set background=dark
" Включает отображение номеров строк
set number
" Включаем ‘умную’ автоматическую расстановку отступов
set smartindent
" Копирует отступ от предыдущей строки » наследовать отступы предыдущей строки
set autoindent
" Размер табуляции
set tabstop=4
" Размер сдвига при нажатии на клавиши «<» и «>»
set shiftwidth=4
" Включить подсветку невидимых символов
set list
" Подсветка текущей строки
set cursorline
" При вставке фрагмента сохраняет отступы
set pastetoggle=
" Включение автоматического перечитывания файла при изменении
set autoread
" установить keymap, чтобы по Ctrl+^ переключалась раскладка клавиатуры при вводе текста на русский и обратно внутри самого редактора
set keymap=russian-jcukenwin
" по умолчанию латинская раскладка
set iminsert=0
" разбивать окно горизонтально снизу
set splitbelow
" разбивать окно вертикально справа
set splitright
" Метод фолдинга — вручную (для обычных файлов)
set foldmethod=manual
" Метод фолдинга — по синтаксису
set foldmethod=syntax
" Опции авто-дополнения
set completeopt=longest,menuone



" Включаем подсветку выражения, которое ищется в тексте
set hlsearch
" Отключение подсветки найденных выражений
" set nohlsearch
" При поиске перескакивать на найденный текст в процессе набора строки (инкрементальный поиск)
" set incsearch
" Если искомое выражения содержит символы в верхнем регистре — ищет с учётом регистра, иначе — без учёта
set smartcase
" Останавливать поиск при достижении конца файла
set nowrapscan
" Игнорировать регистр букв при поиске
set ignorecase
" В режиме поиска используется раскладка, заданная по умолчанию
" set imsearch=-1
" по умолчанию латинская (английская) раскладка при поиске
" set imsearch=0
" хранить больше истории команд
set history=128
" Размер истории для отмены правок
set undolevels=1000
" предлагать авто-дополнение на основе уже введённого регистра
set infercase


" Кодировка по умолчанию
set encoding=utf-8
set termencoding=utf-8
" Формат файла по умолчанию
set fileformat=unix
" Формат файла, который влияет на окончания строк — будет перебирать в указанном порядке
set ffs=mac,unix,dos
" Список кодировок файлов для авто-определения
set fileencodings=utf-8,koi8-r,cp1251,cp866


" Просмотр списка буферов по <F4>
nmap <F4> <Esc>:buffers<CR>
vmap <F4> <Esc>:buffers<CR>
imap <F4> <Esc><Esc>:buffers<CR>
" предыдущий буфер
map <F5> :bp<CR>
vmap <F5> <Esc>:bp<CR>i
imap <F5> <Esc>:bp<CR>i
" следующий буфер
map <F6> :bn<CR>
vmap <F6> <Esc>:bn<CR>i
imap <F6> <Esc>:bn<CR>i
" Переключение табов (вкладок) с помощью SHIFT+TAB и CTRL+TAB
map <S-TAB> :tabprevious<CR>
nmap <S-TAB> :tabprevious<CR>
imap <S-TAB> <Esc>:tabprevious<CR>i
map <C-TAB> :tabnext<CR>
nmap <C-TAB> :tabnext<CR>
imap <C-TAB> <Esc>:tabnext<CR>i
" Открытие\закрытие новой вкладки по CTRL+T и CTRL+W
nmap <C-t> :tabnew<CR>
imap <C-t> <Esc>:tabnew<CR>a
nmap <C-w> :tabclose<CR>
imap <C-w> <Esc>:tabclose<CR>